gillwei7/QAR87_NXP_RT685_main/BT_Audio/evkmimxrt685_a2dp_sink_cm33/source/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_10 (coord E2), J32[10]/CARD_CD/SD_CD
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SD_CD_PERIPHERAL GPIO               /*!<@brief Peripheral name */
#define BOARD_INITPINS_SD_CD_SIGNAL PIO0                   /*!<@brief Signal name */
#define BOARD_INITPINS_SD_CD_CHANNEL 10                    /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SD_CD_GPIO GPIO                     /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SD_CD_GPIO_PIN_MASK (1U << 10U)     /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SD_CD_PORT 0U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SD_CD_PIN 10U                       /*!<@brief PORT pin number */
#define BOARD_INITPINS_SD_CD_PIN_MASK (1U << 10U)          /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_12 (coord K1), J1[7]/Q15[1]/WL_REG_ON
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_WL_REG_ON_PERIPHERAL GPIO                /*!<@brief Peripheral name */
#define BOARD_INITPINS_WL_REG_ON_SIGNAL PIO0                    /*!<@brief Signal name */
#define BOARD_INITPINS_WL_REG_ON_CHANNEL 12                     /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_WL_REG_ON_GPIO GPIO                      /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_WL_REG_ON_GPIO_PIN_MASK (1U << 12U)      /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_WL_REG_ON_PORT 0U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_WL_REG_ON_PIN 12U                        /*!<@brief PORT pin number */
#define BOARD_INITPINS_WL_REG_ON_PIN_MASK (1U << 12U)           /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO0_13 (coord G4), J32[8]/SD_DAT1
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SD_DAT1_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_SD_DAT1_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_SD_DAT1_CHANNEL 13                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SD_DAT1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SD_DAT1_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SD_DAT1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SD_DAT1_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SD_DAT1_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO2_18 (coord B1), U19[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_QSPI_B_DATA5_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_QSPI_B_DATA5_SIGNAL PIO2               /*!<@brief Signal name */
#define BOARD_INITPINS_QSPI_B_DATA5_CHANNEL 18                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_QSPI_B_DATA5_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_QSPI_B_DATA5_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_QSPI_B_DATA5_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QSPI_B_DATA5_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QSPI_B_DATA5_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO2_31 (coord J7), J18[3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_PUR_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_PUR_SIGNAL PIO2               /*!<@brief Signal name */
#define BOARD_INITPINS_I3C0_PUR_CHANNEL 31                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_I3C0_PUR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_I3C0_PUR_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_I3C0_PUR_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I3C0_PUR_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I3C0_PUR_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_0 (coord H3), U7[12]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SWO_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITPINS_SWO_SIGNAL PIO0              /*!<@brief Signal name */
#define BOARD_INITPINS_SWO_CHANNEL 0                /*!<@brief Signal channel */

